{
  "backend/main.mo": "Defines data types, maps, and authorization helpers for users, roles, tasks, soil and weather data, and includes storage and access‑control mixins.",
  "feature_evidence.json": "Contains feature evidence metadata listing feature descriptions, related files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Provides short summaries of various frontend files describing recent UI, data, and component updates.",
  "frontend/index.css": "Defines global Tailwind and OKLCH‑based theme variables for light/dark modes and layout styling.",
  "frontend/index.html": "Basic HTML entry file loading the React app and favicon.",
  "frontend/src/App.tsx": "Sets up routing for all roles and admin pages using TanStack Router with query and auth providers.",
  "frontend/src/auth/AuthProvider.tsx": "Implements demo authentication context with login, logout, session persistence, and role checks.",
  "frontend/src/auth/demoAuth.ts": "Defines demo accounts, credential validation, and localStorage‑based session helpers.",
  "frontend/src/components/AgriTechBanner.tsx": "Renders a reusable agriculture‑technology banner image component.",
  "frontend/src/components/GreenXWordmark.tsx": "Displays the GreenX text wordmark with size and color variants including on‑primary styling.",
  "frontend/src/components/insights/CropHealthPredictionPanel.tsx": "Renders an AI crop health prediction score, label, and explanation with color-coded styling.",
  "frontend/src/components/insights/SmartAlerts.tsx": "Displays a list of smart alerts with severity-based icons and styling.",
  "frontend/src/components/insights/YieldEstimator.tsx": "Shows yield estimation results or triggers a calculation based on acreage and crop type.",
  "frontend/src/components/RoleLogo.tsx": "Displays a role-specific logo image based on the authenticated user's role.",
  "frontend/src/components/TopBar.tsx": "Shows the top navigation bar with branding, user info, role logo, and logout action.",
  "frontend/src/components/weather/ExpertAdvisories.tsx": "Provides weather-based advisories such as fungus risk or spray warnings based on humidity and rain.",
  "frontend/src/components/weather/FieldManagerWeatherActions.tsx": "Displays weather-driven recommendations for spray, irrigation, and pest risk with severity colors.",
  "frontend/src/components/weather/Forecast7Day.tsx": "Shows a 7‑day weather forecast with temperature, rain probability, and humidity for each day.",
  "frontend/src/components/weather/WeatherPanel.tsx": "Displays current weather conditions, status, and risk alerts with temperature, rain, humidity, and wind.",
  "frontend/src/data/demoExports.ts": "Defines export order data and provides demo export records.",
  "frontend/src/data/demoFarmers.ts": "Defines data structures for farmers and includes demo farmer profiles with soil, tasks, payments, and logs.",
  "frontend/src/data/demoInventory.ts": "Defines inventory item data and provides demo stock for inputs, drones, and office supplies.",
  "frontend/src/data/demoYield.ts": "Defines yield data and includes demo expected yields with rainfall per farmer.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, manages login state, and loads or clears stored identities.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode overrides, and custom text-shadow utilities.",
  "frontend/src/layouts/AdminLayout.tsx": "Admin-only layout with sidebar navigation, user info, and logout handling.",
  "frontend/src/lib/aiLikeHeuristics.ts": "Implements heuristic crop health prediction, yield estimation, and weather/soil-based smart alerts.",
  "frontend/src/lib/formatting.ts": "Utility functions to format currency, numbers, percentages, and time durations.",
  "frontend/src/lib/prescriptions.ts": "Generates fertilizer prescriptions based on soil conditions and weather factors.",
  "frontend/src/lib/weatherRecommendations.ts": "Produces spray, irrigation, and pest‑risk recommendations from weather data.",
  "frontend/src/main.tsx": "Bootstraps the app with React, QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/AccessDeniedPage.tsx": "Displays an access-denied message with navigation back to login.",
  "frontend/src/pages/admin/AdminDashboardPage.tsx": "Renders an admin dashboard showing KPIs, export summaries, and inventory snapshots using demo data.",
  "frontend/src/pages/admin/AdminDiagnosticsPage.tsx": "Builds a diagnostics table summarizing crop health and soil data for all demo farmers.",
  "frontend/src/pages/admin/AdminExportOrderDetailPage.tsx": "Displays detailed information for a single export order, including shipment, destination, and financial data.",
  "frontend/src/pages/admin/AdminExportsPage.tsx": "Lists all export orders with key details and links to individual order pages.",
  "frontend/src/pages/admin/AdminFarmersPage.tsx": "Shows a farmer list and detailed profile view with land, revenue, and contract info.",
  "frontend/src/pages/admin/AdminFinancePage.tsx": "Provides financial metrics and a table of revenue, payments, and profitability for each farmer.",
  "frontend/src/pages/admin/AdminLandManagementPage.tsx": "Displays land blocks derived from demo farmer data, showing acreage, crop, farmer, and status in a grid view.",
  "frontend/src/pages/admin/AdminSettingsPage.tsx": "Provides admin controls for notifications, data management actions, and appearance settings.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Renders a table of demo user accounts with roles, contact info, and status indicators for admin management.",
  "frontend/src/pages/admin/AdminWeatherAnalyticsPage.tsx": "Shows village weather status, rainfall vs yield charts, and pest‑risk heat maps using simulated data.",
  "frontend/src/pages/expert/ExpertDashboard.tsx": "Expert dashboard for selecting farmers, viewing weather, crop health predictions, alerts, and generating prescriptions.",
  "frontend/src/pages/field-manager/FieldManagerDashboard.tsx": "Field manager dashboard offering weather data, forecasts, task actions, input logging, and photo uploads for selected farms.",
  "frontend/src/pages/land-owner/LandOwnerCropTimelinePage.tsx": "Displays a crop lifecycle timeline for land owners with completion status for each growth stage.",
  "frontend/src/pages/land-owner/LandOwnerDashboard.tsx": "Renders the land owner dashboard with farmer selection, weather, crop health insights, yield estimation, and smart alerts. Handles navigation, state for selected farmer, and yield calculation.",
  "frontend/src/pages/land-owner/LandOwnerReportsPage.tsx": "Displays summary report cards for crop performance, revenue, and water usage along with a monthly summary. Includes navigation back to the dashboard.",
  "frontend/src/pages/land-owner/LandOwnerSupportRequestPage.tsx": "Provides a form for land owners to submit support requests and shows a confirmation message after submission. Redirects back to the dashboard after a delay.",
  "frontend/src/pages/LoginPage.tsx": "Provides username/password login with demo accounts, redirects by role, and handles errors.",
  "frontend/src/pages/worker/WorkerDashboard.tsx": "Shows worker tasks, weather, attendance, and allows marking tasks complete and uploading photo proofs. Uses local session store for task and attendance management.",
  "frontend/src/state/fieldManagerSessionStore.ts": "Manages field manager session data in localStorage including input logs, task completions, photos, and worker assignments. Provides functions to add, update, and retrieve this data.",
  "frontend/src/state/workerSessionStore.ts": "Handles worker session data such as task completions, photo proofs, and attendance using localStorage. Exposes utilities to update and query stored worker state.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, with support for hash-based routing. Enables persisted parameter retrieval across navigation.",
  "frontend/src/weather/forecast.ts": "Generates a 7-day weather forecast for a village using simulated weather data. Returns daily entries with date, day label, and weather details.",
  "frontend/src/weather/simulatedWeather.ts": "Generates deterministic weather data per village using seeded randomness and computes a risk status with alerts.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project state, issues, required images, and feature definitions for fixing GreenX title visibility and adding agri‑tech visuals and role logos."
}