{
  "kind": "build_request",
  "title": "Fix GreenX title visibility and add agri-tech imagery with role logos",
  "projectName": "GreenX",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the GreenX wordmark so the full title (“GreenX”) is visible in all places it is used (Login header, authenticated TopBar, AdminLayout sidebar header), including on the TopBar where the background is primary-colored and “Green” currently becomes invisible.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "small change inside the app the in GreenX TITTLE ONLY X is appering change that make tittle apper fully"
        ]
      },
      "acceptanceCriteria": [
        "On the authenticated TopBar, both “Green” and “X” are clearly visible in light mode and dark mode.",
        "On the Login page header and AdminLayout sidebar header, the wordmark still renders correctly and remains readable in light mode and dark mode.",
        "The wordmark still renders as text (not an image), with “X” styled distinctly from “Green” as it is now."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add agriculture-technology images (e.g., drones, smart systems, sensors) across the app interfaces by introducing a reusable visual banner/hero illustration component and rendering it on each main role interface page (Land Owner, Field Manager, Worker, Expert) near the top of the page content under the TopBar without breaking existing layouts.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add some agriculture thechnology pic in every interface like drones smart systems secors"
        ]
      },
      "acceptanceCriteria": [
        "Land Owner, Field Manager, Worker, and Expert dashboards each display an agri-tech themed illustration/banner.",
        "The images are served as static frontend assets (not fetched from the backend).",
        "The banner scales responsively for the existing mobile-first layouts and does not overflow containers."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add role-specific logos and display them in the corresponding role interfaces: show the owner logo in the Land Owner interface, the worker logo in the Worker interface, and the expert logo in the Expert interface. Place the role logo in a consistent, visible location (e.g., in the TopBar next to the GreenX wordmark) and keep existing user info and logout behavior unchanged.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "in owner inter face owner logo in worker interface worker logo in exper interface expert logo"
        ]
      },
      "acceptanceCriteria": [
        "When logged in as Land Owner, the owner logo is visible on Land Owner pages.",
        "When logged in as Worker, the worker logo is visible on Worker pages.",
        "When logged in as Expert, the expert logo is visible on Expert pages.",
        "Role logos render correctly in light mode and dark mode and do not overlap the title, user name, role label, or logout button."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add the newly generated images to the project as static assets under frontend/public/assets/generated and update the UI to reference those exact filenames directly from the frontend.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ]
      },
      "acceptanceCriteria": [
        "All newly generated images exist under frontend/public/assets/generated.",
        "All UI references to the new imagery use paths under /assets/generated/ (no backend image serving)."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not modify immutable hook files: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Keep the backend as a single Motoko actor; no backend changes are required for this request."
  ],
  "nonGoals": [
    "Do not add new authentication providers (Internet Identity only).",
    "Do not add real-time features (no WebSockets).",
    "Do not change existing role routing structure or add new roles.",
    "Do not add external image hosting or a backend image pipeline."
  ],
  "imageRequirements": {
    "required": [
      "Wide agri-tech farm illustration featuring drones, sensors, and smart irrigation elements (agri-tech-banner.dim_1200x400.png)",
      "Owner role logo mark, clean vector-style emblem (role-owner-logo.dim_256x256.png)",
      "Worker role logo mark, clean vector-style emblem (role-worker-logo.dim_256x256.png)",
      "Expert role logo mark, clean vector-style emblem (role-expert-logo.dim_256x256.png)"
    ],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [
      "Use English for any user-facing text."
    ],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}